Reports/ПланДляВнешнегоПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ПланДляВнешнегоПользователя</Name>
		</Properties>
	</Report>
</MetaDataObject>

Documents/ДлительностьЭтаповДляВнешнегоПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДлительностьЭтаповДляВнешнегоПользователя</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписьВедущийКонструктор</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписьДизайнер</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписьМенеджер</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписьНачальникаМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписьНачальникаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьВедущийКонструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьДизанер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьНачальникаМонтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьНачальникаПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
								<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродолжительностьМонтажа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродолжительностьПроектирования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродолжительностьРКД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродолжительностьСогласования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродолжительностьТЗ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ПланДляВнешнегоПользователя/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область СобытиеРеквизитов

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ПроектПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти 


#Область СобытиеРеквизитовПродолжение

Процедура ПроектПриИзмененииНаСервере()
	
	ПостроитьДиаграммуГанта(); 
	
КонецПроцедуры 

#КонецОбласти 


#Область ПостроениеяДиаграммы

Процедура ПостроитьДиаграммуГанта()
	
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Проект) Тогда
		Возврат;	
	КонецЕсли;

	ПродолжительностьЭтапов.Загрузить(омГантСервер.ПолучитьДанныеПроектаДляВнешнегоПлана(Проект));
	
	ПустаяДата = Дата(1,1,1);
	
	тзДатыПроекта 			= омГантНаСервере.ПолучитьДатыПроекта(Проект);
	ПолучитьКомплектыДляДобавления(тзДатыПроекта, ПустаяДата);
	тзИнтервалыПомещения 	= омГантНаСервере.ПолучитьИнтервалыПомещения(тзДатыПроекта);
	тзЦвета 				= омДиаграммаГанта.ПолучитьТаблицуЦветов();
	ДлинаРазрываДляГанта	= Проект.ДлинаРазрываДляГанта;
	
	
	
	Серия = Диаграмма.УстановитьСерию("План");
	
	стОтбор = Новый Структура("Композиция, Помещение", Справочники.Композиции.ПустаяСсылка());
	
	Для каждого ЭлементПомещение Из тзИнтервалыПомещения Цикл
		
		стОтбор.Помещение	= ЭлементПомещение.Помещение;
		ПроектТочка 		= ВывестиПомещение(ЭлементПомещение, Серия, тзЦвета, стОтбор);
		
		Для каждого строкаКомплкет Из тзДатыПроекта.НайтиСтроки(стОтбор) Цикл
			стТочкаКомплект = ВывестиКомплект(строкаКомплкет, ЭлементПомещение.Помещение, Серия, тзЦвета, тзДатыПроекта);
		КонецЦикла;
		
	КонецЦикла; 
	
	Элементы.ГруппаКомплектыДляДобавления.Видимость = спКомплектыДляДобавления.Количество() > 0;
	
	Диаграмма.Обновление = Истина;

КонецПроцедуры

Функция ВывестиКомплект(СтрокаКомплкет, РодительТочки, Серия, тзЦвета, тзДатыПроекта)
	
	НаименованиеКомплект 	= СтрокаКомплкет.НаименованиеКомплект;
	СсылкаКомплект 			= СтрокаКомплкет.Комплект;
	
	КомплектТочка 			= Диаграмма.УстановитьТочку(СсылкаКомплект, РодительТочки);
	КомплектТочка.Текст 	= НаименованиеКомплект;
	КомплектТочка.Картинка 	= БиблиотекаКартинок.БыстрыйДоступДобавить;
	
	стДанные = Новый Структура("СсылкаЗначение, Этап, ДатаНачалаПлан, ДатаОкончанияПлан, РодительТочки"
		, СсылкаКомплект, "ТЗ", СтрокаКомплкет.НачалоТЗ, СтрокаКомплкет.ОкончаниеТЗ, СтрокаКомплкет.Помещение);
	ВывестиТочку(КомплектТочка, Серия, стДанные, СсылкаКомплект, тзЦвета,,,,,Истина);
	
	ЭтоКомпозиция = ТипЗнч(СтрокаКомплкет.Комплект) = Тип("СправочникСсылка.Композиции");
	
	стДанные.Этап 				= "Конструирование";
	стДанные.ДатаНачалаПлан 	= СтрокаКомплкет.НачалоПроектирования;
	стДанные.ДатаОкончанияПлан 	= СтрокаКомплкет.ОкончаниеПроектирования;
	ВывестиТочку(КомплектТочка, Серия, стДанные, СсылкаКомплект, тзЦвета,,,,,Истина);
	
	стДанные.Этап 				= "Согласования";
	стДанные.ДатаНачалаПлан 	= СтрокаКомплкет.НачалоСогласования;
	стДанные.ДатаОкончанияПлан 	= СтрокаКомплкет.ОкончаниеСогласования;
	ВывестиТочку(КомплектТочка, Серия, стДанные, СсылкаКомплект, тзЦвета,,,,,Истина);
	
	Если ЭтоКомпозиция Тогда
		
		стДанные.РодительТочки = СтрокаКомплкет.Комплект; 
		СтруктураОтбор = Новый Структура("Композиция", СтрокаКомплкет.Комплект);
		
		Для каждого строкаПодчиненогоКомплкет Из тзДатыПроекта.НайтиСтроки(СтруктураОтбор) Цикл
			
			КомплектТочкаПодчиненый 			= Диаграмма.УстановитьТочку(строкаПодчиненогоКомплкет.Комплект, СтрокаКомплкет.Комплект);
			КомплектТочкаПодчиненый.Текст 		= Строка(строкаПодчиненогоКомплкет.Комплект);
			КомплектТочкаПодчиненый.Картинка 	= БиблиотекаКартинок.БыстрыйДоступСФлажком;
	
			стДанные.Этап 				= "РКД";
			стДанные.ДатаНачалаПлан 	= строкаПодчиненогоКомплкет.НачалоРКД;
			стДанные.ДатаОкончанияПлан 	= строкаПодчиненогоКомплкет.ОкончаниеРКД;
			ВывестиТочку(КомплектТочкаПодчиненый, Серия, стДанные, строкаПодчиненогоКомплкет.Комплект, тзЦвета,,,,,Истина);
			
			стДанные.Этап 				= "Производство";
			стДанные.ДатаНачалаПлан 	= строкаПодчиненогоКомплкет.НачалоПроизводства;
			стДанные.ДатаОкончанияПлан 	= строкаПодчиненогоКомплкет.ОкончаниеПроизводства;
			ВывестиТочку(КомплектТочкаПодчиненый, Серия, стДанные, строкаПодчиненогоКомплкет.Комплект, тзЦвета,,,,,Истина);
			
			стДанные.Этап 				= "Монтаж";
			стДанные.ДатаНачалаПлан 	= строкаПодчиненогоКомплкет.НачалоМонтажа;
			стДанные.ДатаОкончанияПлан 	= строкаПодчиненогоКомплкет.ОкончаниеМонтажа;
			ВывестиТочку(КомплектТочкаПодчиненый, Серия, стДанные, строкаПодчиненогоКомплкет.Комплект, тзЦвета,,,,,Истина);
			
		КонецЦикла;
	Иначе
		
		стДанные.Этап 				= "РКД";
		стДанные.ДатаНачалаПлан 	= СтрокаКомплкет.НачалоРКД;
		стДанные.ДатаОкончанияПлан 	= СтрокаКомплкет.ОкончаниеРКД;
		ВывестиТочку(КомплектТочка, Серия, стДанные, СсылкаКомплект, тзЦвета,,,,,Истина);
		
		стДанные.Этап 				= "Производство";
		стДанные.ДатаНачалаПлан 	= СтрокаКомплкет.НачалоПроизводства;
		стДанные.ДатаОкончанияПлан 	= СтрокаКомплкет.ОкончаниеПроизводства;
		ВывестиТочку(КомплектТочка, Серия, стДанные, СсылкаКомплект, тзЦвета,,,,,Истина);
		
		стДанные.Этап 				= "Монтаж";
		стДанные.ДатаНачалаПлан 	= СтрокаКомплкет.НачалоМонтажа;
		стДанные.ДатаОкончанияПлан 	= СтрокаКомплкет.ОкончаниеМонтажа;
		ВывестиТочку(КомплектТочка, Серия, стДанные, СсылкаКомплект, тзЦвета,,,,,Истина);
		
	КонецЕсли;
	
КонецФункции // ВывестиСделку()

Процедура ВывестиКрайниеТочки(СсылкаКомплект,КомплектТочка,Серия,ЦветКрайнейТочки)
	//стОтбор = Новый Структура("ИзделиеКомплект", СсылкаКомплект);
	//НайденыеСтроки = тзДатыОкончания.НайтиСтроки(стОтбор);
	//Если НайденыеСтроки.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли; 
	//
	//ПочтиСуткиВСекундах = 24 * 3600; //Ширина крайней точки

	//ДанныеДатыЭтап = Новый Структура("ДатаНачалаПлан,ДатаОкончанияПлан,Этап",НайденыеСтроки[0].ОкончаниеПроизводства,НайденыеСтроки[0].ОкончаниеПроизводства + ПочтиСуткиВСекундах,"Окончание производства");
	//
	//ДанныеДатыЭтап.ДатаНачалаПлан 		= НайденыеСтроки[0].ОкончаниеМонтаж;
	//ДанныеДатыЭтап.ДатаОкончанияПлан 	= ДанныеДатыЭтап.ДатаНачалаПлан + ПочтиСуткиВСекундах;
	//ДанныеДатыЭтап.Этап 				= "Окончание монтаж";
	//ВывестиТочку(КомплектТочка, Серия, ДанныеДатыЭтап, Неопределено, Неопределено,Ложь,Ложь,ЦветКрайнейТочки);
	//
	//ДанныеДатыЭтап.ДатаНачалаПлан 		= НайденыеСтроки[0].ОкончаниеСЗапасом;
	//ДанныеДатыЭтап.ДатаОкончанияПлан 	= ДанныеДатыЭтап.ДатаНачалаПлан + ПочтиСуткиВСекундах;
	//ДанныеДатыЭтап.Этап 				= "Окончание с запасом";
	//ВывестиТочку(КомплектТочка, Серия, ДанныеДатыЭтап, Неопределено, Неопределено,Ложь,Ложь,ЦветКрайнейТочки,Ложь,Ложь);
	
КонецПроцедуры // ВывестиКрайниеТочки(СтрокаКомплкет,Серия,тзЦвета)

Функция ВывестиПомещение(ЭлементПомещение, Серия, тзЦвета, стОтбор)
	
	СсылкаПомещение = ЭлементПомещение.Помещение; 
	
	ПомещениеТочка 			= Диаграмма.Точки.Добавить();
	ПомещениеТочка.Текст 	= ЭлементПомещение.ПомещениеНаименование;
	ПомещениеТочка.Значение = СсылкаПомещение;
	ПомещениеТочка.Картинка = БиблиотекаКартинок.Помещение;
	
	стДанные = Новый Структура("СсылкаЗначение, Этап, ДатаНачалаПлан, ДатаОкончанияПлан, РодительТочки"
		, СсылкаПомещение, "Помещение", ЭлементПомещение.НачалоТЗ, ЭлементПомещение.ОкончаниеМонтажа, ЭлементПомещение.Помещение);
	
	ВывестиТочку(ПомещениеТочка, Серия, стДанные, СсылкаПомещение, тзЦвета, Ложь, , , Истина, ,ЭлементПомещение.ПомещениеНаименование);
	
	Возврат ПомещениеТочка; 
	
КонецФункции // ВывестиСделку()

Функция ВывестиТочку(Точка, Серия, ДанныеДатыЭтап, СсылкаЗначение, тзЦвета, Редактирование = Истина, ЕстьРасшифровка = Истина
		, ТекущийЦвет = Неопределено, ЭтоГруппа = Ложь, СократитьНаименование = Ложь, ТекстСообщения = Неопределено)

	ПустаяДата = Дата(1, 1, 1);
	Если ДанныеДатыЭтап.ДатаНачалаПлан = ПустаяДата Тогда
	
		Возврат Неопределено;	
	
	КонецЕсли;
		
	Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
	Значение.Редактирование = Редактирование;
	
	Интервал 				= Значение.Добавить();
	Интервал.Начало 		= ДанныеДатыЭтап.ДатаНачалаПлан;
	Интервал.Конец 			= ?(ДанныеДатыЭтап.ДатаОкончанияПлан - ДанныеДатыЭтап.ДатаНачалаПлан < 24 * 3600, ДанныеДатыЭтап.ДатаНачалаПлан + 24 * 3600, ДанныеДатыЭтап.ДатаОкончанияПлан);
	Интервал.Текст 			= ?(ТекстСообщения = Неопределено, ДанныеДатыЭтап.Этап, ТекстСообщения);
	
	Если НЕ ТекущийЦвет = Неопределено Тогда
		Интервал.Цвет			= ТекущийЦвет;
	ИначеЕсли НЕ тзЦвета = Неопределено Тогда
		Интервал.Цвет			= омДиаграммаГанта.ПолучитьЦвет(ДанныеДатыЭтап.Этап, тзЦвета, ЭтоГруппа);
	КонецЕсли;
	Если ЕстьРасшифровка Тогда
		Интервал.Расшифровка 	= Новый Структура("Этап, Ссылка, РодительТочки"
			, ДанныеДатыЭтап.Этап, ДанныеДатыЭтап.СсылкаЗначение, ДанныеДатыЭтап.РодительТочки);
	Иначе
		Интервал.Расшифровка 	= Неопределено;
	КонецЕсли;
	
	Если СократитьНаименование Тогда
		Интервал.Текст = Лев(Интервал.Текст, 1);
	КонецЕсли;
	
	УстановитьТекстЗначения(Значение.Текст, ДанныеДатыЭтап.ДатаНачалаПлан, ДанныеДатыЭтап.ДатаОкончанияПлан, ДанныеДатыЭтап.Этап); 
	
	Возврат Интервал;
КонецФункции // ВывестиТочку()

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТекстЗначения(Текст, ДатаНачала, ДатаОкончания, Этап)
	Текст = Этап + " " + Формат(ДатаНачала, "ДФ=dd.MM.yy") + " - " + Формат(ДатаОкончания, "ДФ=dd.MM.yy");	
КонецПроцедуры

#КонецОбласти 


#Область РасчетДанныхДиаграммы

Процедура ПолучитьКомплектыДляДобавления(тзДатыПроекта, ПустаяДата)

    спКомплектыДляДобавления.Очистить();
	
	Для каждого х Из тзДатыПроекта Цикл
		
		Если х.НачалоМонтажа = ПустаяДата ИЛИ х.НачалоПроизводства = ПустаяДата ИЛИ х.НачалоПроектирования = ПустаяДата Тогда
		
			спКомплектыДляДобавления.Добавить(х.Комплект, х.НаименованиеКомплект);	
		
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти


#Область ИзменениеРеквизитов

&НаКлиенте
Процедура спКомплектыДляДобавленияПередНачаломДобавления(Элемент, Отказ, Копирование, РодительТочки, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура спКомплектыДляДобавленияПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура спКомплектыДляДобавленияПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаОбработкаРасшифровки(Элемент, Расшифровки, СтандартнаяОбработка, Дата)

	СтандартнаяОбработка = Ложь;
	Если Расшифровки.Количество() > 1 Тогда
		Если НЕ Расшифровки[1] = Неопределено Тогда
			ПоказатьЗначение(,Расшифровки[1].Ссылка);	
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаВыбор(Элемент, Значения, СтандартнаяОбработка, Дата)
	Если Тип("ТочкаДиаграммыГанта") = ТипЗнч(Значения) Тогда
		Если Тип("СправочникСсылка.ИзделияКомплект") = ТипЗнч(Значения.Значение)
			ИЛИ Тип("СправочникСсылка.Композиции") = ТипЗнч(Значения.Значение) Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение(,Значения.Значение);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаПриОкончанииРедактированияИнтервала(Элемент, Интервал, ОтменаРедактирования)
	
	Если НЕ МожноРедактировать Тогда
	
		ОтменаРедактирования = Истина;
		Возврат;
	
	КонецЕсли;
	
	СекундВСутках = 3600 * 24;
	
	Этап 			= Интервал.Расшифровка.Этап;
	Комплект 		= Интервал.Расшифровка.Ссылка;
	РодительТочки	= Интервал.Расшифровка.РодительТочки;
	РазрывВСекундах	= ДлинаРазрываДляГанта * СекундВСутках;
	НеделяСекундах	= 7 * СекундВСутках;
	
	Начало 	= Интервал.Начало;
	Конец 	= Интервал.Конец;
	
	КомплектТочка 	= Диаграмма.УстановитьТочку(Комплект, РодительТочки);
	Серия 			= Диаграмма.УстановитьСерию("План");
	Значение 		= Диаграмма.ПолучитьЗначение(КомплектТочка, Серия);
	Значение.Редактирование = Истина; 
	
	Диаграмма.Обновление = Ложь;
	
	стДанныеДляЗаписи = Новый Структура("ВнешняяДатаНачалоМонтажа, ВнешняяДатаНачалоСогласования, ВнешняяДатаНачалоПроектирования, ВнешняяДатаНачалоПроизводства, ВнешняяДатаОкончаниеМонтажа, ВнешняяДатаОкончаниеСогласования, ВнешняяДатаОкончаниеПроектирования, ВнешняяДатаОкончаниеПроизводства", );			
	стДанныеДляЗаписи.Вставить("Комплект", Комплект);  
	стДанныеДляЗаписи.Вставить("ВнешняяДатаНачалоРКД", );  
	стДанныеДляЗаписи.Вставить("ВнешняяДатаОкончаниеРКД", Комплект);  
	стДанныеДляЗаписи.Вставить("ВнешняяДатаНачалоТЗ", Комплект);  
	стДанныеДляЗаписи.Вставить("ВнешняяДатаОкончаниеТЗ", Комплект);  
	
	Для каждого текЗначение Из Значение Цикл
		Если текЗначение.Расшифровка.Этап = "Конструирование" Тогда
			текЗначениеКонструирование 	= текЗначение;
		ИначеЕсли текЗначение.Расшифровка.Этап = "Согласования" Тогда
			текЗначениеСогласования 	= текЗначение;
		ИначеЕсли текЗначение.Расшифровка.Этап = "Производство" Тогда
			текЗначениеПроизводство 	= текЗначение;
		ИначеЕсли текЗначение.Расшифровка.Этап = "Монтаж" Тогда
			текЗначениеМонтаж 			= текЗначение;
		ИначеЕсли текЗначение.Расшифровка.Этап = "ТЗ" Тогда
			текЗначениеТЗ 				= текЗначение;
		ИначеЕсли текЗначение.Расшифровка.Этап = "РКД" Тогда
			текЗначениеРКД 				= текЗначение;
		КонецЕсли;	
	КонецЦикла;
	
	ПустаяДата = Дата(1, 1, 1);
	
	Если текЗначениеМонтаж = Неопределено Тогда
		стДанныеДляЗаписи.ВнешняяДатаНачалоМонтажа 		= ПустаяДата; 
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеМонтажа 	= ПустаяДата; 
	Иначе
		стДанныеДляЗаписи.ВнешняяДатаНачалоМонтажа 		= текЗначениеМонтаж.Начало; 
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеМонтажа 	= текЗначениеМонтаж.Конец; 
	КонецЕсли;
	
	Если текЗначениеТЗ = Неопределено Тогда
		стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования 	= ПустаяДата; 
		стДанныеДляЗаписи.ВнешняяДатаНачалоТЗ 				= ПустаяДата;
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеТЗ 			= ПустаяДата;
	Иначе
		стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования 	= текЗначениеТЗ.Начало; 
		стДанныеДляЗаписи.ВнешняяДатаНачалоТЗ 				= текЗначениеТЗ.Начало;
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеТЗ 			= текЗначениеТЗ.Конец;
	КонецЕсли;
	
	Если текЗначениеРКД = Неопределено Тогда
		стДанныеДляЗаписи.ВнешняяДатаНачалоРКД 				= ПустаяДата;
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеРКД 			= ПустаяДата;
	Иначе
		стДанныеДляЗаписи.ВнешняяДатаНачалоРКД 				= текЗначениеРКД.Начало;
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеРКД 			= текЗначениеРКД.Конец;
	КонецЕсли;
	
	Если текЗначениеСогласования = Неопределено Тогда
		стДанныеДляЗаписи.ВнешняяДатаНачалоСогласования 	= ПустаяДата; 
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеСогласования 	= ПустаяДата; 
	Иначе
		стДанныеДляЗаписи.ВнешняяДатаНачалоСогласования 	= текЗначениеСогласования.Начало; 
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеСогласования 	= текЗначениеСогласования.Конец; 
	КонецЕсли;
	
	Если текЗначениеКонструирование = Неопределено Тогда
		стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования 	= ПустаяДата; 
	Иначе
		стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования 	= текЗначениеКонструирование.Конец; 
	КонецЕсли;
	
	Если текЗначениеПроизводство = Неопределено Тогда
		стДанныеДляЗаписи.ВнешняяДатаНачалоПроизводства 	= ПустаяДата; 
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроизводства 	= ПустаяДата; 
	Иначе
		стДанныеДляЗаписи.ВнешняяДатаНачалоПроизводства 	= текЗначениеПроизводство.Начало; 
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроизводства 	= текЗначениеПроизводство.Конец; 
	КонецЕсли;
	
	стОтбор = Новый Структура("Комплект", Комплект);
	
	НайденыеСтроки = ПродолжительностьЭтапов.НайтиСтроки(стОтбор);
	
	Если НайденыеСтроки.Количество() = 0 Тогда
		
		ДлинаКонструирования 	= текЗначениеКонструирование.Конец 	- текЗначениеКонструирование.Начало;
		ДлинаСогласования 		= текЗначениеСогласования.Конец 	- текЗначениеСогласования.Начало;
		ДлинаПроизводства 		= текЗначениеПроизводство.Конец 	- текЗначениеПроизводство.Начало;
		ДлинаМонтажа 			= текЗначениеМонтаж.Конец 			- текЗначениеМонтаж.Начало;
		ДлинаРКД	 			= текЗначениеРКД.Конец 				- текЗначениеРКД.Начало;
		ДлинаТЗ		 			= текЗначениеТЗ.Конец 				- текЗначениеТЗ.Начало;
		
	Иначе
		
		ДлинаКонструирования 	= НайденыеСтроки[0].ПродолжительностьПроектирования * НеделяСекундах;
		ДлинаСогласования 		= НайденыеСтроки[0].ПродолжительностьСогласования	* НеделяСекундах;
		ДлинаПроизводства 		= НайденыеСтроки[0].ПродолжительностьПроизводства	* НеделяСекундах;
		ДлинаМонтажа	 		= НайденыеСтроки[0].ПродолжительностьМонтажа		* НеделяСекундах;
		ДлинаРКД	 			= НайденыеСтроки[0].ПродолжительностьРКД			* НеделяСекундах;
		ДлинаТЗ		 			= НайденыеСтроки[0].ПродолжительностьТЗ				* НеделяСекундах;
		
	КонецЕсли;
	
	
	ДлинаКонструирования 	= ?(ДлинаКонструирования 	< СекундВСутках, СекундВСутках, ДлинаКонструирования);
	ДлинаСогласования 		= ?(ДлинаСогласования 		< СекундВСутках, СекундВСутках, ДлинаСогласования);
	ДлинаПроизводства 		= ?(ДлинаПроизводства 		< СекундВСутках, СекундВСутках, ДлинаПроизводства);
	ДлинаМонтажа 			= ?(ДлинаМонтажа 			< СекундВСутках, СекундВСутках, ДлинаМонтажа);
	ДлинаРКД 				= ?(ДлинаРКД 				< СекундВСутках, СекундВСутках, ДлинаРКД);
	ДлинаТЗ 				= ?(ДлинаТЗ 				< СекундВСутках, СекундВСутках, ДлинаТЗ);
	
	ТипИнтервала = "Общий";
	Если ТипЗнч(Интервал.Расшифровка.РодительТочки) = Тип("СправочникСсылка.Композиции") Тогда
		ТипИнтервала = "ВКомпозиции";
	ИначеЕсли ТипЗнч(Комплект) = Тип("СправочникСсылка.Композиции") Тогда	
		ТипИнтервала = "Композиция";
	КонецЕсли;
	
	Если Этап = "ТЗ" Тогда
		
		ПолучитьСмещениеЭтапов(Начало, РазрывВСекундах, СекундВСутках, ДлинаКонструирования, ДлинаСогласования, ДлинаПроизводства, ДлинаМонтажа, ДлинаРКД, ДлинаТЗ, стДанныеДляЗаписи, ТипИнтервала);
		
	ИначеЕсли Этап = "Конструирование" Тогда
		
		ПолучитьСмещениеЭтапов(Начало - ДлинаТЗ, РазрывВСекундах, СекундВСутках, ДлинаКонструирования, ДлинаСогласования, ДлинаПроизводства, ДлинаМонтажа, ДлинаРКД, ДлинаТЗ, стДанныеДляЗаписи, ТипИнтервала);
		
	ИначеЕсли Этап = "Согласования" Тогда

		стДанныеДляЗаписи.ВнешняяДатаНачалоСогласования 		= Начало; 
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеСогласования 		= Конец; 
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроектирования	= стДанныеДляЗаписи.ВнешняяДатаНачалоСогласования 		- РазрывВСекундах;
		стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования		= стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроектирования 	- ДлинаКонструирования - ДлинаТЗ;
		
		ПолучитьСмещениеЭтапов(стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования, РазрывВСекундах, СекундВСутках, ДлинаКонструирования, ДлинаСогласования, ДлинаПроизводства, ДлинаМонтажа, ДлинаРКД, ДлинаТЗ, стДанныеДляЗаписи, ТипИнтервала);

	ИначеЕсли Этап = "РКД" Тогда

		стДанныеДляЗаписи.ВнешняяДатаНачалоРКД 					= Начало; 
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеРКД 				= Конец; 
		//стДанныеДляЗаписи.ВнешняяДатаОкончаниеСогласования 		= стДанныеДляЗаписи.ВнешняяДатаОкончаниеРКД 			- РазрывВСекундах; 
		//стДанныеДляЗаписи.ВнешняяДатаНачалоСогласования 		= стДанныеДляЗаписи.ВнешняяДатаОкончаниеСогласования	- ДлинаСогласования; 
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроектирования	= стДанныеДляЗаписи.ВнешняяДатаНачалоСогласования 		- РазрывВСекундах;
		стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования		= стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроектирования 	- ДлинаКонструирования - ДлинаТЗ;
		
		//ПолучитьСмещениеЭтапов(стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования, РазрывВСекундах, СекундВСутках, ДлинаКонструирования, ДлинаСогласования, ДлинаПроизводства, ДлинаМонтажа, ДлинаРКД, ДлинаТЗ, стДанныеДляЗаписи, ТипИнтервала);

	ИначеЕсли Этап = "Производство" Тогда
		
		стДанныеДляЗаписи.ВнешняяДатаНачалоПроизводства 		= Начало; 
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроизводства 		= Конец; 
		//стДанныеДляЗаписи.ВнешняяДатаОкончаниеСогласования		= стДанныеДляЗаписи.ВнешняяДатаНачалоПроизводства 		- РазрывВСекундах;
		//стДанныеДляЗаписи.ВнешняяДатаНачалоРКД					= стДанныеДляЗаписи.ВнешняяДатаОкончаниеСогласования 	- ДлинаРКД;
		//стДанныеДляЗаписи.ВнешняяДатаОкончаниеРКД				= стДанныеДляЗаписи.ВнешняяДатаНачалоРКД 				- РазрывВСекундах;
		//стДанныеДляЗаписи.ВнешняяДатаНачалоСогласования			= стДанныеДляЗаписи.ВнешняяДатаОкончаниеРКД 			- ДлинаСогласования;
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроектирования	= стДанныеДляЗаписи.ВнешняяДатаНачалоСогласования		- РазрывВСекундах;
		//стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования 		= стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроектирования	- ДлинаКонструирования;
		//стДанныеДляЗаписи.ВнешняяДатаНачалоТЗ 					= стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования		- ДлинаТЗ;
		//стДанныеДляЗаписи.ВнешняяДатаОкончаниеСогласования		= стДанныеДляЗаписи.ВнешняяДатаНачалоПроизводства 		- РазрывВСекундах;
		//стДанныеДляЗаписи.ВнешняяДатаНачалоРКД					= стДанныеДляЗаписи.ВнешняяДатаОкончаниеСогласования 	- ДлинаРКД;
		//стДанныеДляЗаписи.ВнешняяДатаОкончаниеРКД				= стДанныеДляЗаписи.ВнешняяДатаНачалоРКД 				- РазрывВСекундах;
		//стДанныеДляЗаписи.ВнешняяДатаНачалоСогласования			= стДанныеДляЗаписи.ВнешняяДатаОкончаниеРКД 			- ДлинаСогласования;
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроектирования	= стДанныеДляЗаписи.ВнешняяДатаНачалоСогласования		- РазрывВСекундах;
		//стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования 		= стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроектирования	- ДлинаКонструирования;
		//стДанныеДляЗаписи.ВнешняяДатаНачалоТЗ 					= стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования		- ДлинаТЗ;
		
		ПолучитьСмещениеЭтапов(стДанныеДляЗаписи.ВнешняяДатаНачалоТЗ, РазрывВСекундах, СекундВСутках, ДлинаКонструирования, ДлинаСогласования, ДлинаПроизводства, ДлинаМонтажа, ДлинаРКД, ДлинаТЗ, стДанныеДляЗаписи, ТипИнтервала);

	Иначе
		
		стДанныеДляЗаписи.ВнешняяДатаНачалоМонтажа 				= Начало; 
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеМонтажа 			= Конец; 
		//стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроизводства		= стДанныеДляЗаписи.ВнешняяДатаНачалоМонтажа 			- РазрывВСекундах;
		//стДанныеДляЗаписи.ВнешняяДатаНачалоПроизводства			= стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроизводства 	- ДлинаПроизводства;
		//стДанныеДляЗаписи.ВнешняяДатаОкончаниеСогласования		= стДанныеДляЗаписи.ВнешняяДатаНачалоПроизводства 		- РазрывВСекундах;
		//стДанныеДляЗаписи.ВнешняяДатаНачалоРКД					= стДанныеДляЗаписи.ВнешняяДатаОкончаниеСогласования 	- ДлинаРКД;
		//стДанныеДляЗаписи.ВнешняяДатаОкончаниеРКД				= стДанныеДляЗаписи.ВнешняяДатаНачалоРКД 				- РазрывВСекундах;
		//стДанныеДляЗаписи.ВнешняяДатаНачалоСогласования			= стДанныеДляЗаписи.ВнешняяДатаОкончаниеРКД 			- ДлинаСогласования;
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроектирования	= стДанныеДляЗаписи.ВнешняяДатаНачалоСогласования		- РазрывВСекундах;
		стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования 		= стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроектирования	- ДлинаКонструирования;
		//стДанныеДляЗаписи.ВнешняяДатаНачалоТЗ 					= стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования		- ДлинаТЗ;
		
		//ПолучитьСмещениеЭтапов(стДанныеДляЗаписи.ВнешняяДатаНачалоТЗ, РазрывВСекундах, СекундВСутках, ДлинаКонструирования, ДлинаСогласования, ДлинаПроизводства, ДлинаМонтажа, ДлинаРКД, ДлинаТЗ, стДанныеДляЗаписи, ТипИнтервала);
		
	КонецЕсли;
	
	Если НЕ текЗначениеТЗ = Неопределено Тогда
		
		текЗначениеТЗ.Начало 				= стДанныеДляЗаписи.ВнешняяДатаНачалоТЗ;
		текЗначениеТЗ.Конец 				= стДанныеДляЗаписи.ВнешняяДатаОкончаниеТЗ;
		
	КонецЕсли;
	
	Если НЕ текЗначениеКонструирование = Неопределено Тогда
		
		текЗначениеКонструирование.Начало 	= стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования;
		текЗначениеКонструирование.Конец 	= стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроектирования;
		
	КонецЕсли;
	
	Если НЕ текЗначениеСогласования = Неопределено Тогда
		
		текЗначениеСогласования.Начало 		= стДанныеДляЗаписи.ВнешняяДатаНачалоСогласования;
		текЗначениеСогласования.Конец 		= стДанныеДляЗаписи.ВнешняяДатаОкончаниеСогласования;
		
	КонецЕсли;
	
	Если НЕ текЗначениеРКД = Неопределено Тогда
		
		текЗначениеРКД.Начало 				= стДанныеДляЗаписи.ВнешняяДатаНачалоРКД;
		текЗначениеРКД.Конец 				= стДанныеДляЗаписи.ВнешняяДатаОкончаниеРКД;
		
	КонецЕсли;
	
	Если НЕ текЗначениеПроизводство = Неопределено Тогда
		
		текЗначениеПроизводство.Начало 		= стДанныеДляЗаписи.ВнешняяДатаНачалоПроизводства;
		текЗначениеПроизводство.Конец 		= стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроизводства;
		
	КонецЕсли;
	
	Если НЕ текЗначениеМонтаж = Неопределено Тогда
		
		текЗначениеМонтаж.Начало 			= стДанныеДляЗаписи.ВнешняяДатаНачалоМонтажа;
		текЗначениеМонтаж.Конец 			= стДанныеДляЗаписи.ВнешняяДатаОкончаниеМонтажа; 
		
	КонецЕсли;
	
	ЗаписатьНаСервере(стДанныеДляЗаписи);
	
	Попытка
		
		РодительТочки = текЗначениеКонструирование.Значение.Точка.Родитель.Значение;
		
	Исключение
		
		РодительТочки = Неопределено;
		
	КонецПопытки;
	
	Если ЗначениеЗаполнено(РодительТочки) Тогда
		
		КомплектТочка 	= Диаграмма.УстановитьТочку(РодительТочки);
		Значение 		= Диаграмма.ПолучитьЗначение(КомплектТочка, Серия);
		Значение.Редактирование = Истина; 
		
		мДанныеПомещения = ПолучитьДанныеОПомещенииНаСервере(Проект, РодительТочки);
		
		Если мДанныеПомещения.Количество() > 0 Тогда
			
			Для каждого текЗначение Из Значение Цикл
				Если мДанныеПомещения[0].ОкончаниеМонтажа > мДанныеПомещения[0].НачалоТЗ Тогда
					текЗначение.Начало 	= мДанныеПомещения[0].НачалоТЗ;
					текЗначение.Конец 	= мДанныеПомещения[0].ОкончаниеМонтажа;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
		Значение.Редактирование = Ложь;
		
	КонецЕсли;
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

Функция ПолучитьСмещениеЭтапов(Начало, РазрывВСекундах, СекундВСутках, ДлинаКонструирования, ДлинаСогласования, ДлинаПроизводства, ДлинаМонтажа, ДлинаРКД, ДлинаТЗ, стДанныеДляЗаписи, ТипИнтервала)
	
	Если ТипИнтервала = "Композиция" ИЛИ ТипИнтервала = "Общий" Тогда
		
		стДанныеДляЗаписи.ВнешняяДатаНачалоТЗ 					= ПолучитьНачалоНедели(Начало, СекундВСутках); 
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеТЗ 				= ПолучитьКонецНедели(стДанныеДляЗаписи.ВнешняяДатаНачалоТЗ + ДлинаТЗ - РазрывВСекундах, СекундВСутках); 
		стДанныеДляЗаписи.ВнешняяДатаНачалоПроектирования 		= стДанныеДляЗаписи.ВнешняяДатаОкончаниеТЗ 	+ РазрывВСекундах; 
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроектирования 	= ПолучитьКонецНедели(стДанныеДляЗаписи.ВнешняяДатаОкончаниеТЗ  + ДлинаКонструирования, СекундВСутках); 
		стДанныеДляЗаписи.ВнешняяДатаНачалоСогласования 		= стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроектирования 	+ РазрывВСекундах;
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеСогласования 		= ПолучитьКонецНедели(стДанныеДляЗаписи.ВнешняяДатаНачалоСогласования  		+ ДлинаСогласования, СекундВСутках);
		
	КонецЕсли;
	
	Если ТипИнтервала = "ВКомпозиции" ИЛИ ТипИнтервала = "Общий" Тогда
		
		//стДанныеДляЗаписи.ВнешняяДатаНачалоРКД 					= ?(ТипИнтервала = "Общий",
		//															стДанныеДляЗаписи.ВнешняяДатаОкончаниеСогласования  	+ РазрывВСекундах,
		//															стДанныеДляЗаписи.ВнешняяДатаНачалоРКД);
		//стДанныеДляЗаписи.ВнешняяДатаОкончаниеРКД 				= ПолучитьКонецНедели(стДанныеДляЗаписи.ВнешняяДатаНачалоРКД  				+ ДлинаРКД, СекундВСутках);
		//стДанныеДляЗаписи.ВнешняяДатаНачалоПроизводства 		= стДанныеДляЗаписи.ВнешняяДатаОкончаниеРКД  			+ РазрывВСекундах;
		//стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроизводства 		= ПолучитьКонецНедели(стДанныеДляЗаписи.ВнешняяДатаНачалоПроизводства  		+ ДлинаПроизводства, СекундВСутках);
		//стДанныеДляЗаписи.ВнешняяДатаНачалоМонтажа		 		= стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроизводства  	+ РазрывВСекундах;
		//стДанныеДляЗаписи.ВнешняяДатаОкончаниеМонтажа 			= ПолучитьКонецНедели(стДанныеДляЗаписи.ВнешняяДатаНачалоМонтажа  			+ ДлинаМонтажа, 	 СекундВСутках);
		
		стДанныеДляЗаписи.ВнешняяДатаНачалоРКД 					= ПолучитьНачалоНедели(стДанныеДляЗаписи.ВнешняяДатаНачалоРКД, 			СекундВСутках);
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеРКД 				= ПолучитьКонецНедели(стДанныеДляЗаписи.ВнешняяДатаНачалоРКД, 			СекундВСутках);
		стДанныеДляЗаписи.ВнешняяДатаНачалоПроизводства 		= ПолучитьНачалоНедели(стДанныеДляЗаписи.ВнешняяДатаНачалоПроизводства, СекундВСутках);
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеПроизводства 		= ПолучитьКонецНедели(стДанныеДляЗаписи.ВнешняяДатаНачалоПроизводства + ДлинаПроизводства, СекундВСутках);
		стДанныеДляЗаписи.ВнешняяДатаНачалоМонтажа		 		= ПолучитьНачалоНедели(стДанныеДляЗаписи.ВнешняяДатаНачалоМонтажа, 		СекундВСутках);
		стДанныеДляЗаписи.ВнешняяДатаОкончаниеМонтажа 			= ПолучитьКонецНедели(стДанныеДляЗаписи.ВнешняяДатаОкончаниеМонтажа, 	СекундВСутках);
		
	КонецЕсли;
	
КонецФункции // ПолучитьСмещениеЭтапов()

Функция ПолучитьНачалоНедели(текДата, СекундВСутках)

	Возврат НачалоДня(текДата - (ДеньНедели(текДата) - 1) * СекундВСутках);
	
КонецФункции // получитьКонецНедели()

Функция ПолучитьКонецНедели(текДата, СекундВСутках)
	
	Возврат КонецДня(текДата + (7 - ДеньНедели(текДата)) * СекундВСутках);
	
КонецФункции // получитьКонецНедели()

&НаСервереБезКонтекста
Функция ПолучитьДанныеОПомещенииНаСервере(Проект, РодительТочки)

	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(омГантНаСервере.ПолучитьИнтервалыПомещения(омГантНаСервере.ПолучитьДатыПроекта(Проект, РодительТочки)));
	

КонецФункции // ПолучитьДанныеОПомещенииНаСервере(РодительТочки)

&НаСервереБезКонтекста
Процедура ЗаписатьНаСервере(стДанныеДляЗаписи)

	Если ТипЗнч(стДанныеДляЗаписи.Комплект) = Тип("СправочникСсылка.Композиции") Тогда
	
		МассивКомплектов = Новый Массив;
		МассивКомплектов.Добавить(стДанныеДляЗаписи.Комплект);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИзделияКомплект.Ссылка КАК Комплект
			|ИЗ
			|	Справочник.ИзделияКомплект КАК ИзделияКомплект
			|ГДЕ
			|	ИзделияКомплект.Родитель.Композиция = &Композиция";
		
		Запрос.УстановитьПараметр("Композиция", стДанныеДляЗаписи.Комплект);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МассивКомплектов.Добавить(Выборка.Комплект);
		КонецЦикла;
	
	Иначе
	
		МассивКомплектов = Новый Массив(1);
		МассивКомплектов[0] = стДанныеДляЗаписи.Комплект;
	
	КонецЕсли;
	
	Период = ТекущаяДата();

	Для каждого ТекущийКомплект Из МассивКомплектов Цикл
		
		стДанныеДляЗаписи.Комплект = ТекущийКомплект;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ *
			|ИЗ
			|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплекта";
			
		Запрос.УстановитьПараметр("Комплект", стДанныеДляЗаписи.Комплект);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		НаборЗаписей = РегистрыСведений.ДанныеКомплекта.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Период);
		НаборЗаписей.Отбор.Комплект.Установить(стДанныеДляЗаписи.Комплект);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		КонецЦикла;
		
		НоваяЗапись.Период = Период; 
		ЗаполнитьЗначенияСвойств(НоваяЗапись, стДанныеДляЗаписи);
		
		НоваяЗапись.Автор = ПараметрыСеанса.ТекущийПользователь;
		
		НаборЗаписей.Записать();
	КонецЦикла;
		

КонецПроцедуры

#КонецОбласти 

#Область ДействияФормы

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МожноРедактировать = РольДоступна("Менеджер") ИЛИ РольДоступна("ПолныеПрава");
	
	Параметры.Свойство("Проект", Проект);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаДобавления 				= ТекущаяДата();
	Диаграмма.ОтображатьЛегенду = Ложь;
	Если ЗначениеЗаполнено(Проект) Тогда
		ПроектПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область Команды

&НаКлиенте
Процедура ДобавитьКомплекты(Команда)
	ДобавитьКомплектыНаСервере();
КонецПроцедуры
	
#КонецОбласти


#Область ИсполнениеКоманды

&НаСервере
Процедура ДобавитьКомплектыНаСервере()
	
	СекундВСутках  	= 3600 * 24;
	РазрывВСекундах	= ДлинаРазрываДляГанта * СекундВСутках;
	ДлинаЭтапа  	= СекундВСутках * 7;
	Период			= ТекущаяДата();
	Автор 			= ПараметрыСеанса.ТекущийПользователь;
	
	тзДлинаЭтапа 	= ПолучитьДлиныЭтапов();
	
	ДатаДобавленияНачалоНедели = ПолучитьНачалоНедели(ДатаДобавления, СекундВСутках);
	
	Для каждого х Из спКомплектыДляДобавления Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	*
			|ИЗ
			|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &Комплект) КАК ДанныеКомплекта";
		
		Запрос.УстановитьПараметр("Комплект", х.Значение);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		НаборЗаписей = РегистрыСведений.ДанныеКомплекта.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Комплект.Установить(х.Значение);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		КонецЦикла;
		
		НайденаяСтрока = тзДлинаЭтапа.Найти(х.Значение, "Комплект");
		
		Если НайденаяСтрока = Неопределено Тогда
			
			ПродолжительностьТЗ 			= ДлинаЭтапа;
			ПродолжительностьПроектирования = ДлинаЭтапа;
			ПродолжительностьСогласования	= ДлинаЭтапа;
			ПродолжительностьРКД			= ДлинаЭтапа;
			ПродолжительностьПроизводства	= ДлинаЭтапа;
			ПродолжительностьМонтажа 		= ДлинаЭтапа;
			
		Иначе
		
			Если НайденаяСтрока.ПродолжительностьТЗ= 0 Тогда
				ПродолжительностьТЗ = ДлинаЭтапа
			Иначе	
			    ПродолжительностьТЗ	= НайденаяСтрока.ПродолжительностьТЗ * ДлинаЭтапа;
			КонецЕсли;	
			
			Если НайденаяСтрока.ПродолжительностьПроектирования = 0 Тогда
				ПродолжительностьПроектирования = ДлинаЭтапа;
			Иначе	
			    ПродолжительностьПроектирования	= НайденаяСтрока.ПродолжительностьПроектирования * ДлинаЭтапа;
			КонецЕсли;	
			
			Если НайденаяСтрока.ПродолжительностьСогласования = 0 Тогда
				ПродолжительностьСогласования 	= ДлинаЭтапа;
			Иначе	
			    ПродолжительностьСогласования	= НайденаяСтрока.ПродолжительностьСогласования * ДлинаЭтапа;
			КонецЕсли;	
			
			Если НайденаяСтрока.ПродолжительностьРКД = 0 Тогда
				ПродолжительностьРКД 	= ДлинаЭтапа;
			Иначе	
			    ПродолжительностьРКД	= НайденаяСтрока.ПродолжительностьРКД * ДлинаЭтапа;
			КонецЕсли;	
			
			Если НайденаяСтрока.ПродолжительностьПроизводства = 0 Тогда
				ПродолжительностьПроизводства 	= ДлинаЭтапа;
			Иначе	
			    ПродолжительностьПроизводства	= НайденаяСтрока.ПродолжительностьПроизводства * ДлинаЭтапа;
			КонецЕсли;	
			
			Если НайденаяСтрока.ПродолжительностьМонтажа = 0 Тогда
				ПродолжительностьМонтажа 	= ДлинаЭтапа;
			Иначе	
			    ПродолжительностьМонтажа	= НайденаяСтрока.ПродолжительностьМонтажа * ДлинаЭтапа;
			КонецЕсли;	
		
		КонецЕсли;
		
		НоваяЗапись.Период 								= Период; 
		НоваяЗапись.Комплект 							= х.Значение; 
		НоваяЗапись.Автор 								= Автор;
		НоваяЗапись.ВнешняяДатаНачалоТЗ 				= ДатаДобавленияНачалоНедели;
		НоваяЗапись.ВнешняяДатаОкончаниеТЗ 				= НоваяЗапись.ВнешняяДатаНачалоТЗ 					+ ПродолжительностьТЗ;
		НоваяЗапись.ВнешняяДатаНачалоПроектирования 	= НоваяЗапись.ВнешняяДатаОкончаниеТЗ 				+ РазрывВСекундах;
		НоваяЗапись.ВнешняяДатаОкончаниеПроектирования 	= НоваяЗапись.ВнешняяДатаОкончаниеТЗ				+ ПродолжительностьПроектирования;
		НоваяЗапись.ВнешняяДатаНачалоСогласования 		= НоваяЗапись.ВнешняяДатаОкончаниеПроектирования 	+ РазрывВСекундах;
		НоваяЗапись.ВнешняяДатаОкончаниеСогласования 	= НоваяЗапись.ВнешняяДатаНачалоСогласования 		+ ПродолжительностьСогласования;
		НоваяЗапись.ВнешняяДатаНачалоРКД 				= НоваяЗапись.ВнешняяДатаОкончаниеСогласования 		+ РазрывВСекундах;
		НоваяЗапись.ВнешняяДатаОкончаниеРКД 			= НоваяЗапись.ВнешняяДатаОкончаниеСогласования 		+ ПродолжительностьРКД;
		НоваяЗапись.ВнешняяДатаНачалоПроизводства 		= НоваяЗапись.ВнешняяДатаОкончаниеРКД 				+ РазрывВСекундах;
		НоваяЗапись.ВнешняяДатаОкончаниеПроизводства 	= НоваяЗапись.ВнешняяДатаОкончаниеРКД 				+ ПродолжительностьПроизводства;
		НоваяЗапись.ВнешняяДатаНачалоМонтажа 			= НоваяЗапись.ВнешняяДатаОкончаниеПроизводства     	+ РазрывВСекундах;
		НоваяЗапись.ВнешняяДатаОкончаниеМонтажа 		= НоваяЗапись.ВнешняяДатаОкончаниеПроизводства 		+ ПродолжительностьМонтажа;
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	Элементы.ГруппаКомплектыДляДобавления.Видимость = Ложь;
	
	ПостроитьДиаграммуГанта();	
	
КонецПроцедуры

Функция ПолучитьДлиныЭтапов()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДлительностьЭтаповДляВнешнегоПользователяКомплекты.Комплект КАК Комплект,
		|	ДлительностьЭтаповДляВнешнегоПользователяКомплекты.ПродолжительностьТЗ КАК ПродолжительностьТЗ,
		|	ДлительностьЭтаповДляВнешнегоПользователяКомплекты.ПродолжительностьПроектирования КАК ПродолжительностьПроектирования,
		|	ДлительностьЭтаповДляВнешнегоПользователяКомплекты.ПродолжительностьСогласования КАК ПродолжительностьСогласования,
		|	ДлительностьЭтаповДляВнешнегоПользователяКомплекты.ПродолжительностьРКД КАК ПродолжительностьРКД,
		|	ДлительностьЭтаповДляВнешнегоПользователяКомплекты.ПродолжительностьМонтажа КАК ПродолжительностьМонтажа,
		|	МАКСИМУМ(ДлительностьЭтаповДляВнешнегоПользователяКомплекты.Ссылка.Дата) КАК Дата,
		|	ДанныеКомплектаСрезПоследних.ВнешняяПродолжительностьПроизводства КАК ПродолжительностьПроизводства
		|ИЗ
		|	Документ.ДлительностьЭтаповДляВнешнегоПользователя.Комплекты КАК ДлительностьЭтаповДляВнешнегоПользователяКомплекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
		|		ПО ДлительностьЭтаповДляВнешнегоПользователяКомплекты.Комплект = ДанныеКомплектаСрезПоследних.Комплект
		|ГДЕ
		|	ДлительностьЭтаповДляВнешнегоПользователяКомплекты.Ссылка.Проведен
		|	И ДлительностьЭтаповДляВнешнегоПользователяКомплекты.Комплект В(&Комплект)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДлительностьЭтаповДляВнешнегоПользователяКомплекты.Комплект,
		|	ДлительностьЭтаповДляВнешнегоПользователяКомплекты.ПродолжительностьТЗ,
		|	ДлительностьЭтаповДляВнешнегоПользователяКомплекты.ПродолжительностьПроектирования,
		|	ДлительностьЭтаповДляВнешнегоПользователяКомплекты.ПродолжительностьСогласования,
		|	ДлительностьЭтаповДляВнешнегоПользователяКомплекты.ПродолжительностьРКД,
		|	ДлительностьЭтаповДляВнешнегоПользователяКомплекты.ПродолжительностьМонтажа,
		|	ДанныеКомплектаСрезПоследних.ВнешняяПродолжительностьПроизводства";
	
	Запрос.УстановитьПараметр("Комплект", спКомплектыДляДобавления);
	
	Возврат Запрос.Выполнить().Выгрузить();
	

КонецФункции // ПолучитьДлиныЭтапов()

#КонецОбласти

&НаКлиенте
Процедура Печать(Команда)
	ОткрытьФорму("Отчет.ПланДляВнешнегоПользователя.Форма.ФормаПечати",
		Новый Структура("Проект, МассивЗадачи", Проект, ПолучитьМассивДанных(Проект)));
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивДанных(Проект)                                                                                                  

	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(омГантНаСервере.ПолучитьДатыПроекта(Проект));	

КонецФункции // ПолучитьМассивДанных()
